const books = 
    [
        {
            name: "پایتون",
            number: 1,
            writer: "استیو جابز",
            amount: "50,000",
            due: "1403/01/10",
            des:` این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
             این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
              این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است `,
            pic: "../img/book.webp",
        },
        {
            name: "سی پلاس",
            number: 2,
            writer: " مارک زاکربرگ",
            amount: "30,000",
            due: "1401/02/10",
            des:` این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
            این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
             این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است `,
            pic: "../img/book2.webp",
        },
        {
            name: "جاوا اسکریپت",
            number: 3,
            writer: "بیل گیتس",
            amount: "60,000",
            due: "1400/01/10",
            des:` این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
            این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
             این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است `,
            pic: "../img/book3.webp",
        },
        {
            name: "سی شارپ",
            number: 4,
            writer: " مجتبی بخشی پور",
            amount: "66,000",
            due: "1402/05/20",
            des:` این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
            این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
             این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است `,
            pic: "../img/book4.webp",
        },
        {
            name: "جنگو",
            number: 5,
            writer: " ترامپ",
            amount: "80,000",
            due: "1403/03/01",
            des:` این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
             این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است 
              این کتاب با موضوع برنامه نویسی به نویسندگی استیو جابز ، برنده جایزه بسیاری شده است `,
            pic: "../img/book.webp",
        },

    ]


export const getBooks = () => {
    return books;
}

export const getBook = (num) => {
    return books.find(book => book.number === num);
}